MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
/*!
 * @file mit_sim_main.cpp
 * @brief STM32MP1 MIT_Controller (convex MPC + WBC) against a Gazebo (Go1) SITL.
 *   mit_ctrl_sim [peer_ip] [robot_yaml] [user_yaml]
 * Runs the full locomotion FSM. With $WP_MISSION set it also closes an
 * OpenPilot-style GPS waypoint loop around it - see navThread() below.
 */
#include <string>
#include <cstdio>
#include <cstdlib>
#include <cmath>
#include <thread>
#include <chrono>
#include <unistd.h>   // _exit

#include "Stm32mp1HardwareBridge.h"
#include "MIT_Controller.hpp"
#include "WaypointNav.hpp"
#include "Planning/BodyPathPlanner.h"
#include "Planning/MissionAnalyzer.h"
#include "rt/rt_gazebo.h"      // gazebo_get_aux(): GPS, the same data the real dog gets over CAN

//! Defined in FSM_State_StandUp.cpp - lets the mission lower the stance target
//! so re-entering STAND_UP performs a controlled lie-down.
void setStandUpHeight(double h);
//! Defined in RobotRunner.cpp - Unitree-style damping hold (edampCommand).
void setEdamp(double d);
//! Situational stance-height bias into the controller's height governor, m.
void setHeightBias(double b);

static std::string g_peer;

/*!
 * Waypoint navigation for the MIT stack.
 *
 * The crawl (StaticGaitController) drives nav from inside its own controller
 * because it owns its gait. The MIT stack must not be reached into like that -
 * ConvexMPCLocomotion already consumes a velocity and a yaw rate through
 * DesiredStateCommand, which is exactly the interface an operator's stick uses.
 * So nav writes the SAME two channels the sequencer and a gamepad write:
 *   leftStickAnalog[1]  -> forward velocity  (_x_vel_des)
 *   rightStickAnalog[0] -> yaw rate          (_yaw_turn_rate)
 * Nothing in the FSM, the MPC or the WBC has to know navigation exists.
 *
 * Takeover: the bridge sequencer already stands the robot, enters LOCOMOTION,
 * lets the gait engage and ramps velocity to $SIM_VX. Nav waits for that ramp
 * to finish (it watches the stick the sequencer is driving) and then owns both
 * channels. Because the star mission's first waypoint lies due north and the
 * dog spawns facing north, the handover happens mid-stride on the correct
 * heading - no pivot in place.
 */
static void navThread(Stm32mp1HardwareBridge* bridge) {
  const char* mission = getenv("WP_MISSION");
  if (!mission) return;

  const float vx = getenv("SIM_VX") ? atof(getenv("SIM_VX")) : 0.6f;
  WaypointNav nav;
  float r = 3.f, d = 5.f; int pts = 5;
  if (sscanf(mission, "star:%f:%d", &r, &pts) >= 1)        nav.makeStar(r, pts, vx);
  else if (sscanf(mission, "oval:%f:%f", &d, &r) >= 1) {
    // "oval:<straight m>:<radius m>" - see makeOval for why this course exists.
    if (sscanf(mission, "oval:%f:%f", &d, &r) < 2) r = 3.0f;
    nav.makeOval(d, r,
                 getenv("WP_OVAL_DS") ? atof(getenv("WP_OVAL_DS")) : 1.2f, vx);
  }
  else if (sscanf(mission, "atom:%f:%d", &r, &pts) >= 1) {
    // "atom:<outer radius m>[:<lobes>]" - depth and waypoint spacing are
    // secondary knobs, so the mission string keeps only the two that change
    // the character of the course.
    if (sscanf(mission, "atom:%f:%d", &r, &pts) < 2) pts = 6;   // 6 = the logo
    nav.makeAtom(r, pts,
                 getenv("WP_ATOM_DEPTH") ? atof(getenv("WP_ATOM_DEPTH")) : 0.8f,
                 getenv("WP_ATOM_DS")    ? atof(getenv("WP_ATOM_DS"))    : 1.2f, vx);
  }
  else if (sscanf(mission, "circle:%f:%d", &r, &pts) >= 1) nav.makeCircle(r, pts, vx);
  else if (sscanf(mission, "outback:%f", &d) == 1)         nav.makeOutAndBack(d, vx);
  else                                                     nav.makeStar(5.3f, 5, vx);

  // $WP_DASH=<metres>: append a straight finishing sprint after the loop
  // above closes, continuing along whatever heading the final leg left the
  // dog on. This is the 100 m dash as a FINISH, not a standalone course - the
  // dog proves it can corner the whole loop, then gets to show what its gait
  // does in a straight line once there is nothing left to turn for.
  //
  // Per direct instruction, the handoff between loop and dash is not just a
  // waypoint change: the dog stops, lies down, and stands back up before the
  // sprint - the same lie-down/stand-up the QA ladder already rehearses at
  // the true end of every mission (see the END-OF-MISSION SEQUENCE below),
  // just run once more in the middle instead of only at the finish.
  // loop_wp_count marks the boundary: appendDash() now inserts TWO
  // waypoints (an explicit return to wp00, THEN the dash point), so the
  // interlude should fire once the RETURN leg is complete and the dash
  // point becomes active - one PAST loop_wp_count, not at it - so the dog
  // has genuinely closed the shape before it stops and lies down.
  const int loop_wp_count = nav.count();
  bool dash_pending = false;
  if (getenv("WP_DASH")) {
    nav.appendDash(atof(getenv("WP_DASH")), vx);
    dash_pending = nav.count() > loop_wp_count;
  }
  const int dash_wp_index = loop_wp_count + 1;

  if (getenv("WP_ACCEPT"))   nav.accept_radius = atof(getenv("WP_ACCEPT"));
  if (getenv("WP_LOOP"))     nav.loop = true;
  // The MPC trot turns far harder than the crawl, which is what max_yawrate was
  // sized for (0.7 rad/s was "what the crawl can actually deliver").
  nav.max_yawrate = getenv("WP_MAX_YAWRATE") ? atof(getenv("WP_MAX_YAWRATE")) : 1.2f;
  nav.kp_heading  = getenv("WP_KP_HEADING")  ? atof(getenv("WP_KP_HEADING"))  : 2.2f;
  // Dynamic gaits arc through corners; they fall over trying to pivot in them.
  nav.turn_speed_floor = getenv("WP_TURN_FLOOR") ? atof(getenv("WP_TURN_FLOOR")) : 0.65f;

  // YAW SIGN: +1, and this was MEASURED, not reasoned. The old default of -1
  // captured 1 of 5 waypoints and never finished a mission; +1 captures 5 of 5
  // and completes the 100 m star in 46.5 s. Same binary, same run, one flag.
  //
  // Why -1 looked right and was wrong: the comment here used to say "MIT's yaw
  // rate is CCW-positive, nav's is compass-sense, so negate". Both halves are
  // true, but the chain has a THIRD negation in it -
  // `DesiredStateCommand.cpp` does `joystickRight[0] *= -1` (upstream MIT, and
  // correct: right stick right should turn the robot right). Two negations
  // cancel, so negating here inverted the steering and the robot turned away
  // from every waypoint. A sign argued from two of three terms is a guess.
  const float yaw_sign = getenv("WP_YAW_SIGN") ? atof(getenv("WP_YAW_SIGN")) : 1.f;

