MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
  /*
   * $WP_PLANNER=1 swaps the pure-pursuit follower for the Apollo-derived
   * planner: the waypoint polyline is rounded into fillet arcs, curvature gives
   * v_max(s) = sqrt(a_lat/kappa), and forward/backward accel passes make the
   * braking start BEFORE the corner instead of during it. The heuristic it
   * replaces (WP_TURN_FLOOR) completes 2 runs in 3 and fails badly if tuned any
   * deeper, which is what a hand-picked constant tends to do.
   */
  const bool use_planner = getenv("WP_PLANNER") && atoi(getenv("WP_PLANNER")) != 0;
  const bool  use_analyzer = getenv("WP_ANALYZER") && atoi(getenv("WP_ANALYZER")) != 0;
  const float analyzer_lead = getenv("WP_ANALYZER_LEAD") ? atof(getenv("WP_ANALYZER_LEAD")) : 4.0f;

  planning::BodyPathPlanner planner;
  planning::MissionAnalyzer analyzer;
  if (use_planner) {
    // The path must START WHERE THE ROBOT IS. Building it from the waypoints
    // alone begins it at wp00, 10.5 m away, so the follower spent the whole
    // mission chasing a path it was never on: 75.1 m of path (4 legs) instead
    // of 93 m (5), and 0 of 5 waypoints. The robot sits at the local-frame
    // origin when the GPS datum is taken, so (0,0) is the true first point.
    std::vector<double> wx{0.0}, wy{0.0};
    for (int i = 0; i < nav.count(); ++i) {
      wx.push_back(nav.waypoint(i).north);
      wy.push_back(nav.waypoint(i).east);
    }
    planning::BodyLimits lim;
    lim.v_cruise  = vx;
    lim.a_lat_max = getenv("WP_ALAT") ? atof(getenv("WP_ALAT")) : 2.5;

    lim.yaw_rate_max = nav.max_yawrate;
    lim.track_lag_s  = getenv("WP_LAG") ? atof(getenv("WP_LAG")) : 1.2;
    planner.setLimits(lim);
    if (getenv("WP_ALON")) planner.setAlonExplicit(atof(getenv("WP_ALON")));
    if (getenv("WP_AACC")) { auto L=planner.limits(); L.a_accel_max=atof(getenv("WP_AACC")); planner.setLimits(L); }
    if (getenv("WP_TURN_SOFT")) { auto L=planner.limits(); L.turn_soft=atof(getenv("WP_TURN_SOFT")); planner.setLimits(L); }
    if (getenv("WP_TURN_HARD")) { auto L=planner.limits(); L.turn_hard=atof(getenv("WP_TURN_HARD")); planner.setLimits(L); }
    if (getenv("WP_CSCALE"))    { auto L=planner.limits(); L.corner_scale_min=atof(getenv("WP_CSCALE")); planner.setLimits(L); }
    // Same turn_soft/turn_hard grading, applied to the fillet's geometric
    // corridor instead of the lateral-accel budget - shrinks how far an
    // acute corner's rounded arc misses the true vertex by. See the field
    // comment on BodyLimits::corridor_scale_min.
    if (getenv("WP_CORRIDOR_MIN")) { auto L=planner.limits(); L.corridor_scale_min=atof(getenv("WP_CORRIDOR_MIN")); planner.setLimits(L); }
    if (getenv("WP_HAIRPIN")) { auto L = planner.limits(); L.hairpin_rad = atof(getenv("WP_HAIRPIN")); planner.setLimits(L); }
    if (getenv("WP_VPIVOT"))  { auto L = planner.limits(); L.v_pivot     = atof(getenv("WP_VPIVOT"));  planner.setLimits(L); }
    const double corridor = getenv("WP_ACCEPT") ? atof(getenv("WP_ACCEPT")) : 1.0;
    planner.plan(wx, wy, 0.10, false, corridor);
    /*
     * ANALYSE THE MISSION ONCE, HERE, BEFORE THE DOG MOVES.
     *
     * Everything about a route that can be known is known now: the geometry is
     * fixed, so the curvature, the speed each point allows, which turns last
     * long enough to need a different gait, and where the time is actually
     * lost are all computable before the first step. Re-deriving any of it at
     * 50 Hz from a filtered estimate is strictly worse, and has already
     * produced a decider that could not tell a star vertex from an atom lobe.
     */
    planning::MissionPolicy pol;
    pol.kappa_min     = getenv("WP_REGIME_K")   ? atof(getenv("WP_REGIME_K"))   : pol.kappa_min;
    pol.sustained_m   = getenv("WP_REGIME_LEN") ? atof(getenv("WP_REGIME_LEN")) : pol.sustained_m;
    pol.min_switch_m  = getenv("WP_MIN_SWITCH") ? atof(getenv("WP_MIN_SWITCH")) : pol.min_switch_m;
    pol.gait_fast     = getenv("WP_GAIT_FAST")   ? atoi(getenv("WP_GAIT_FAST"))   : pol.gait_fast;
    pol.gait_sustained= getenv("WP_GAIT_CORNER") ? atoi(getenv("WP_GAIT_CORNER")) : pol.gait_sustained;
    pol.hbias_max     = getenv("WP_HBIAS")      ? atof(getenv("WP_HBIAS"))      : pol.hbias_max;
    pol.v_sustained_max = getenv("WP_VSUS") ? atof(getenv("WP_VSUS")) : pol.v_sustained_max;
    // ALWAYS analyse (the brief is free and worth having in every log), but
    // only ACT on it when asked. applyTo() imposes the sustained-curve speed
    // ceiling, which is a behaviour change - running it unconditionally made
    // the "bare" arm of an A/B not bare, and would have silently treated the
    // control group on every atom phase where sustained segments dominate.
    analyzer.analyze(planner, pol);
    if (use_analyzer) {
      // Two-pass: classify, impose the ceiling, re-plan, re-classify so the
      // printed brief is the plan the robot actually flies.
      analyzer.applyTo(planner, pol);
      analyzer.analyze(planner, pol);
    }
    analyzer.print();

    double kk, vv; planner.tightestCorner(&kk, &vv);
    printf("[plan] %zu pts, %.1f m, tightest R=%.2f m -> %.2f m/s "
           "(cruise %.2f, a_lat %.2f, corridor %.2f)\n",
           planner.path().size(), planner.path().empty() ? 0.0 : planner.path().back().s,
           kk > 1e-6 ? 1.0/kk : 0.0, vv, lim.v_cruise, lim.a_lat_max, corridor);
    fflush(stdout);
  }

  /*
   * TAKE THE STICK OURSELVES, from LOCOMOTION entry - not by waiting for the
   * bridge's own straight-line ramp to finish, which is what used to run the
   * dog dead ahead for the whole delay+ramp window before nav ever steered
   * (see the WP_MISSION guard added around that ramp in
   * Stm32mp1HardwareBridge.cpp for the measured symptom and why it is wrong
   * for a mission specifically). Wait for control_mode == 4 (K_LOCOMOTION),
   * then hold the SAME gait-engage settle the old ramp used
   * ($SIM_VX_DELAY_S, still the standing-gait settle time, not a straight-line
   * hold) before calling nav.update() for the first time - the planner's own
   * accel limit (a_lon/a_accel_max) ramps speed from the standstill the robot
   * is actually at, while STEERING from tick one instead of after 15 s of
   * running straight.
   */
  while (bridge->getControlMode() != 4)
    std::this_thread::sleep_for(std::chrono::milliseconds(50));
  {
    float settle_s = getenv("SIM_VX_DELAY_S") ? atof(getenv("SIM_VX_DELAY_S")) : 3.f;
    printf("[nav] LOCOMOTION engaged - holding %.1f s for the gait to settle "
           "before nav takes the stick\n", settle_s);
    fflush(stdout);
    std::this_thread::sleep_for(std::chrono::milliseconds((long)(settle_s * 1000.f)));
  }

  const auto t0 = std::chrono::steady_clock::now();
  auto elapsed = [&t0]() {
    return std::chrono::duration<float>(std::chrono::steady_clock::now() - t0).count();
  };
  printf("[nav] taking the stick at t=%.1fs (mission %s)\n", elapsed(), mission);
  fflush(stdout);
  /*
   * Anchor for the forward-speed ramp below - NOT armed on the initial
   * takeover (restart_t starts a full ramp window in the past, so vscale is
   * 1.0 immediately). BodyPathPlanner::computeSpeedProfile() now forces
   * _path[0].v = 0 and ramps it forward itself with the SAME accel limit, so
   * applying a second, independent time-based ramp here on top of that
   * double-ramps and desyncs the caller's notion of "how far along the plan
   * am I" from the plan's own arc-length-based one - measured to cost the
   * star ~4 s and a visibly wide, arcing entry into its first corner (see
   * the comment at that _path[0].v = 0 assignment for the full account).
   * The dash interlude's stand-back-up IS a genuine standstill the
   * pre-computed profile does not know about (plan() is never called again
   * mid-mission), so THAT restart still arms this ramp for real.
   */
  const float vx_ramp_s = getenv("SIM_VX_RAMP_S") ? atof(getenv("SIM_VX_RAMP_S")) : 3.f;
  float restart_t = elapsed() - vx_ramp_s;

