MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
    /*
     * PRE-LOAD STANCE HEIGHT FOR THE CORNER AHEAD. The controller's height
     * governor regulates height reactively off the robot's own state; this is
     * the planner telling it, ahead of time, that the ground is about to ask
     * for more. $WP_HBIAS is metres of extra height at full lateral budget
     * (0 = planner stays out of it and the governor runs purely reactive).
     */
    /*
     * READ THE ANNOTATED MISSION. A lookup, not a computation: the segment
     * `lead` metres ahead already carries the gait to be in and the stance
     * height to have pre-loaded by the time the demand arrives.
     */
    const planning::MissionSegment* seg = nullptr;
    if (use_analyzer && use_planner)
      seg = analyzer.segmentAhead(planner.currentS(), analyzer_lead);
    if (seg) setHeightBias(seg->height_bias);
    else if (use_planner && hbias_gain > 0.f)
      setHeightBias(planner.plannedHeightBias(hbias_ahead, hbias_gain));

    if (seg && bridge->userParams() && seg->gait != cur_gait) {
      ControlParameterValue cv; cv.d = (double)seg->gait;
      bridge->userParams()->collection.lookup("cmpc_gait")
          .set(cv, ControlParameterValueKind::DOUBLE);
      printf("[mission] gait %d -> %d entering %s at s=%.1f (R=%.2f, cost %+.2f s) t=%.1fs\n",
             cur_gait, seg->gait,
             seg->regime == 2 ? "SUSTAINED" : (seg->regime == 1 ? "transient" : "straight"),
             seg->s0, seg->radius_min, seg->time_cost, elapsed());
      fflush(stdout);
      cur_gait = seg->gait;
    }

    if (gait_decider && !use_analyzer && use_planner && bridge->userParams()) {
      // Slowest planned speed within decide_ahead metres: if a corner is
      // coming, commit to the corner gait NOW, while still able to.
      const double vplan = planner.minPlannedSpeedAhead(decide_ahead);
      int want;
      if (regime_mode) {
        /*
         * DECIDE ON THE DURATION OF THE TURN, NOT ITS SEVERITY.
         *
         * The old rule below keys off planned SPEED, which reads a star vertex
         * and an atom lobe identically - and they want opposite gaits.
         * trotRunning is 32/32 on the star (whose corners are over in a metre)
         * and 3/8 on the atom (whose curvature is held for ten-plus metres).
         * regimeAhead() separates them by how long the turn lasts.
         */
        const int reg = planner.regimeAhead(decide_ahead, regime_kappa, regime_len);
        want = (reg == 2) ? gait_corner : gait_fast;
      }
      else if (vplan >= 2.2)                      want = gait_fast;
      else if (gait_tight > 0 && vplan < v_tight) want = gait_tight;
      else                                        want = gait_corner;
      /*
       * THE GATE IS ASYMMETRIC, because the risk is.
       *
       *   -> trotRunning (flight gait) at 2.63 m/s : FATAL (fell instantly)
       *   -> trotRunning at 1.2 m/s                : fine, 2/2
       *   -> walking  at 2.0 m/s                   : fine, 2/2
       *   -> trotting at 2.0 m/s                   : fine, 1/1
       *
       * Dropping to a MORE STABLE gait is safe at speed; climbing to a flight
       * gait is not. A symmetric gate blocked the drop until the robot had
       * already braked to 1.6 m/s - which on this course is the corner apex,
       * far too late - so it entered every corner still in the fast gait and
       * fell. Going UP still waits for low speed; going DOWN may happen
       * whenever the target gait can hold the current speed.
       */
      // Dropping to the stable gait is UNGATED. The only measured danger is
      // climbing to a flight gait at speed; nothing in the data says a
      // down-switch is unsafe (walking at 2.0: 2/2, trotting at 2.0: 1/1).
      // Gating the drop by the target gait's COMMAND ceiling was wrong twice
      // over: trotRunning at 3.0 commanded actually cruises at 3.6 m/s, so a
      // 3.1 gate blocked the drop entirely and the robot entered every corner
      // still in the flight gait - the exact failure the decider exists to
      // prevent.
      // "Down" means toward the more stable end of the ladder
      // (trotRunning -> trotting -> walking); only climbing toward a flight
      // gait is speed-gated, because that is the only direction measured to
      // fail (fatal at 2.63 m/s, fine at 1.2).
      auto tierOf = [&](int g){ return g == gait_fast ? 2 : (g == gait_tight ? 0 : 1); };
      const bool going_down = tierOf(want) < tierOf(cur_gait);
      const bool may_switch = going_down ? true : (spd < decide_v);
      { static int gdbg = 0;
        if ((++gdbg % 50) == 0)
          printf("[gaitdbg] vplan=%.2f want=%d cur=%d spd=%.2f down=%d may=%d\n",
                 vplan, want, cur_gait, spd, (int)going_down, (int)may_switch),
          fflush(stdout); }
      if (want != cur_gait && may_switch) {
        ControlParameterValue cv; cv.d = (double)want;
        bridge->userParams()->collection.lookup("cmpc_gait")
            .set(cv, ControlParameterValueKind::DOUBLE);
        printf("[gait] %d -> %d at v=%.2f (planned %.2f) t=%.1fs\n",
               cur_gait, want, spd, vplan, elapsed());
        fflush(stdout);
        cur_gait = want;
      }
    }

    if (nav.activeIndex() != lastIdx) {
      lastIdx = nav.activeIndex();
      printf("[nav] -> wp%02d of %d  t=%.1fs\n", lastIdx, nav.count(), elapsed());
      fflush(stdout);
    }

    /*
     * LOOP-TO-DASH INTERLUDE. The loop closed AND the explicit return to
     * wp00 (appendDash()'s first inserted point) is done - nav has just
     * advanced onto the actual dash waypoint - so stop, settle, lie down,
     * then stand back up before sprinting the dash, exactly mirroring the
     * end-of-mission sequence below rather than inventing a second one.
     * This blocks the thread for its duration (a few seconds), which is
     * fine: nothing else needs the stick during a controlled sit-and-stand,
     * and the alternative (driving it from the 50 Hz loop with a state
     * machine) buys nothing but complexity for a one-shot event.
     */
    if (dash_pending && lastIdx == dash_wp_index) {
      dash_pending = false;
      printf("[nav] loop complete at t=%.1fs - stop, lie down, stand back up "
             "before the %s dash\n", elapsed(), mission);
      fflush(stdout);

      // 1. decelerate from cruise - a stepped-to-zero stick pitches the
      //    robot forward on the way down, same reasoning as end-of-mission.
      for (int k = 20; k >= 0; --k) {
        bridge->driverCommand().leftStickAnalog[1]  = vx * (float)k / 20.f;
        bridge->driverCommand().rightStickAnalog[0] = 0.f;
        std::this_thread::sleep_for(std::chrono::milliseconds(75));
      }
      bridge->driverCommand().leftStickAnalog[1]  = 0.f;
      bridge->driverCommand().rightStickAnalog[0] = 0.f;

      // 2. settle on its feet
      bridge->setControlMode(3);                 // K_BALANCE_STAND
      std::this_thread::sleep_for(std::chrono::milliseconds(1500));

