MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
      // 3. lie down - re-enter STAND_UP with a low target (see the
      //    end-of-mission comment for why this reuses that interpolation).
      //    BALANCE_STAND -> STAND_UP is not a legal FSM transition
      //    (FSM_State_BalanceStand::checkTransition()'s switch has no
      //    K_STAND_UP case - every request fell to `default`, printing
      //    "Bad Request: Cannot transition from 3 to 1" and being silently
      //    ignored, so the dog just stood there under BALANCE_STAND's own
      //    control indefinitely - measured on a 3-dog fleet run: over a
      //    hundred rejected requests, then an eventual orientation-safety
      //    fall from prolonged undriven standing, never an actual lie-down).
      //    K_STAND_UP IS legal from K_PASSIVE
      //    (FSM_State_Passive::checkTransition() has that case), which is
      //    also the FSM's OWN normal bootstrap path (PASSIVE -> STAND_UP ->
      //    BALANCE_STAND -> LOCOMOTION), so hop through PASSIVE first.
      // PASSIVE cuts leg torque entirely at the FSM level, but
      // RobotRunner::finalizeStep() applies edampCommand() AFTER the FSM
      // state's own control regardless of which state is active - so
      // damping through this hop is not fighting PASSIVE, it is what
      // actually reaches the legs while PASSIVE would otherwise leave them
      // at true zero. Without this, a still-tall standing robot free-falls
      // for however long PASSIVE holds - measured as a real collapse
      // (roll/pitch/z all dropping) even at a bare 300 ms.
      setEdamp(8.0);
      bridge->setControlMode(0);                 // K_PASSIVE
      // As BRIEF as possible regardless - the FSM only needs ONE control
      // tick (2 ms) to register PASSIVE as current before it will accept
      // the next request, so this only has to outlast scheduling jitter.
      std::this_thread::sleep_for(std::chrono::milliseconds(20));
      // Hand off to STAND_UP's own controlled Cartesian interpolation
      // undamped - edamp fighting an active position controller defeats
      // the point of using that interpolation at all.
      setEdamp(0.0);
      setStandUpHeight(0.07);
      bridge->setControlMode(1);                 // K_STAND_UP
      std::this_thread::sleep_for(std::chrono::milliseconds(2500));
      setEdamp(8.0);
      std::this_thread::sleep_for(std::chrono::milliseconds(1200));

      // 4. stand back up - restore the normal stand-up target (0.25, from
      //    FSM_State_StandUp.cpp's g_standUpHeight default) and go back
      //    through the SAME staged entry used at mission start: STAND_UP ->
      //    BALANCE_STAND -> LOCOMOTION. Skipping BALANCE_STAND here would
      //    hand the MPC the same 9 cm height step CLAUDE.md already measured
      //    as a launch (z 0.211 -> 0.342 at 0.32 m/s vertical).
      setEdamp(0.0);
      setStandUpHeight(0.25);
      bridge->setControlMode(1);                 // K_STAND_UP
      std::this_thread::sleep_for(std::chrono::milliseconds(2500));
      bridge->setControlMode(3);                 // K_BALANCE_STAND
      std::this_thread::sleep_for(std::chrono::milliseconds(1500));
      bridge->setControlMode(4);                 // K_LOCOMOTION
      // Let the gait engage before asking it to go anywhere - the same
      // settle window the initial sequencer holds at mission start.
      std::this_thread::sleep_for(std::chrono::milliseconds(1000));

      restart_t = elapsed();   // ramp forward speed again from this standstill
      printf("[nav] back up at t=%.1fs - dashing the final leg\n", elapsed());
      fflush(stdout);
    }

    if (!running) {
      printf("[nav] MISSION COMPLETE t=%.1fs  (%d waypoints)\n", elapsed(), nav.count());
      fflush(stdout);
      bridge->driverCommand().leftStickAnalog[1]  = 0.f;
      bridge->driverCommand().rightStickAnalog[0] = 0.f;
      done = true;
      /*
       * END-OF-MISSION SEQUENCE, and the PASS/FAIL criterion.
       *
       * Reaching the last waypoint is not a completed mission - a robot that
       * arrives and then falls over has not done the job. The mission now ends
       * the way it began, in reverse: decelerate, settle on its feet, then LIE
       * DOWN under control. PASS requires all of it; anything else is FAIL.
       *
       * This also exercises exactly the transitions the hardware QA ladder
       * starts with (stand -> lie down -> stand up -> slow walk), so a mission
       * that passes here has rehearsed the sequence a real dog has to survive.
       */
      // 1. decelerate. Zeroing the stick from cruise is a step input - the
      //    robot pitches forward and goes down, which is why every completed
      //    star run used to be followed by a [FALL] three seconds later.
      for (int k = 20; k >= 0; --k) {
        bridge->driverCommand().leftStickAnalog[1] = nv * (float)k / 20.f;
        bridge->driverCommand().rightStickAnalog[0] = 0.f;
        std::this_thread::sleep_for(std::chrono::milliseconds(75));
      }
      bridge->driverCommand().leftStickAnalog[1] = 0.f;

      // 2. settle on its feet
      bridge->setControlMode(3);                 // K_BALANCE_STAND
      std::this_thread::sleep_for(std::chrono::milliseconds(1500));
      const auto& s1 = bridge->robotRunner()->getStateEstimate();
      const float stand_z = s1.position[2];
      const float stand_roll  = std::fabs(s1.rpy[0]) * 57.2958f;
      const float stand_pitch = std::fabs(s1.rpy[1]) * 57.2958f;

      // 3. LIE DOWN: re-enter STAND_UP with a low target so the same Cartesian
      //    interpolation that stands the robot up lowers it instead.
      //    BALANCE_STAND -> STAND_UP is not a legal FSM transition (see the
      //    matching comment in the loop-to-dash interlude above, where this
      //    was actually caught: FSM_State_BalanceStand::checkTransition()
      //    has no K_STAND_UP case, so this request was silently rejected
      //    every tick and the "lie down" never happened - hop through
      //    K_PASSIVE first, which IS a legal source for K_STAND_UP and is
      //    the FSM's own normal bootstrap path.
      // PASSIVE cuts leg torque entirely at the FSM level, but
      // RobotRunner::finalizeStep() applies edampCommand() AFTER the FSM
      // state's own control regardless of which state is active - so
      // damping through this hop is not fighting PASSIVE, it is what
      // actually reaches the legs while PASSIVE would otherwise leave them
      // at true zero. Without this, a still-tall standing robot free-falls
      // for however long PASSIVE holds - measured as a real collapse
      // (roll/pitch/z all dropping) even at a bare 300 ms.
      setEdamp(8.0);
      bridge->setControlMode(0);                 // K_PASSIVE
      // As BRIEF as possible regardless - the FSM only needs ONE control
      // tick (2 ms) to register PASSIVE as current before it will accept
      // the next request, so this only has to outlast scheduling jitter.
      std::this_thread::sleep_for(std::chrono::milliseconds(20));
      // Hand off to STAND_UP's own controlled Cartesian interpolation
      // undamped - edamp fighting an active position controller defeats
      // the point of using that interpolation at all.
      setEdamp(0.0);
      setStandUpHeight(0.07);
      bridge->setControlMode(1);                 // K_STAND_UP
      std::this_thread::sleep_for(std::chrono::milliseconds(2500));
      // 3b. DAMPING HOLD - Unitree's second phase. Their sequence is
      //     StandDown (interpolate the joints down) then edampCommand, so the
      //     robot settles compliant rather than holding a pose stiffly or going
      //     limp. Ported from LegController<T>::edampCommand at 0x1af2c0.
      setEdamp(8.0);
      std::this_thread::sleep_for(std::chrono::milliseconds(1200));
      const auto& s2 = bridge->robotRunner()->getStateEstimate();
      const float down_z = s2.position[2];
      const float down_roll  = std::fabs(s2.rpy[0]) * 57.2958f;
      const float down_pitch = std::fabs(s2.rpy[1]) * 57.2958f;

